aligotr.markdown-preview-toc-sidebar
ardonplay.vscode-jetbrains-icon-theme
bpruitt-goddard.mermaid-markdown-syntax-highlighting
charliermarsh.ruff
continue.continue
detachhead.basedpyright
eamodio.gitlens
fabiospampinato.vscode-highlight
formulahendry.code-runner
hbenl.vscode-test-explorer
kevinrose.vsc-python-indent
littlefoxteam.vscode-python-test-adapter
mermaidchart.vscode-mermaid-chart
ms-python.debugpy
ms-python.python
ms-vscode.test-adapter-converter
nickmillerdev.pytest-fixtures
njqdev.vscode-python-typehint
pependuez.pytest-run-assistant
pomdtr.excalidraw-editor
teticio.python-envy
tonsky.theme-alabaster
tonybaloney.vscode-pets
vscodevim.vim
